INSERT INTO 
    test 
VALUES 
    (1)
; 


INSERT INTO 
    books (title, author)
VALUES 
    ('ドラゴンボール', '鳥山明'), 
    ('ワンピース', '尾田栄一郎'),
    ('名探偵コナン', '青山剛昌'),
    ('ゴールデンカムイ', '野田サトル'),
    ('進撃の巨人', '諫山創')
; 

INSERT INTO 
    book_details (book_id, context)
VALUES 
    (1, 'サイヤ人いっぱい'), 
    (2, '海賊いっぱい'),
    (3, '犯人は毛利小五郎'),
    (4, 'おそま'),
    (5, '巨人でかい')
;

INSERT INTO 
    genres (code, name)
VALUES 
    ('J001', 'アクション'), 
    ('J002', 'コメディ'),
    ('J003', 'ミステリー'),
    ('J004', 'ジャンプ'),
    ('J005', 'ファンタジー'),
    ('J006', 'ホラー')
;

INSERT INTO 
    book_genres (book_id, genre_code)
VALUES 
    (1, 'J001'), 
    (1, 'J004'),
    (1, 'J005'),
    (2, 'J001'),
    (2, 'J004'),
    (2, 'J005'),
    (3, 'J001'),
    (3, 'J003'),
    (4, 'J001'),
    (4, 'J002'),
    (4, 'J003'),
    (5, 'J001'),
    (5, 'J005')
;

INSERT INTO 
    goods (goods_id, name, color, size, price) 
VALUES 
    ('P001', 'にんじん', 'オレンジ', 'S', '安い'),
    ('P002', 'ピーマン', '緑', 'S', '安い'),
    ('P003', 'トマト', '赤', 'M', '安い'),
    ('P004', 'じゃがいも', '茶','L', '普通'),
    ('P005', 'たまねぎ', '黄', 'L', '安い'),
    ('P006', 'きゅうり', '緑', 'S', '安い'),
    ('P007', 'なす', '紫', 'M', '普通'),
    ('P008', 'かぼちゃ', 'オレンジ', 'XL', '高い'),
    ('P009', 'ほうれん草', '緑', 'S', '普通'),
    ('P010', 'キャベツ', '緑', 'XL', '安い'),
    ('P011', 'レタス', '黄緑', 'L', '普通'),
    ('P012', 'ブロッコリー', '緑', 'M', '高い'),
    ('P013', 'アスパラガス', '緑', 'S', '高い'),
    ('P014', 'さつまいも', '紫', 'L', 'めっちゃ高い'),
    ('P015', '大根', '白', 'XL', '普通'),
    ('P016', 'ごぼう', '茶', 'M', '高い'),
    ('P017', 'パプリカ', '黄', 'S', 'めっちゃ高い'),
    ('P018', 'ブルーベリー', '紺','S', '高い'),
    ('P019', 'いちご', '赤', 'M', 'めっちゃ高い'),
    ('P020', 'メロン', '黄緑', 'XL', 'めっちゃ高い')
;